import React, { useContext } from 'react'
import FontContext from '../context/FontContext'
import Header from '../layout/Header';
import './Preface.css'
import LanguageContext from '../context/LanguageContext';

function AboutTheBook() {

  const context = useContext(FontContext);
  const languageContext = useContext(LanguageContext);
  const getFontFamily = () => {
    return languageContext.language === 'Tamil' ? 'Mukta, sans-serif' : 'Nunito, sans-serif';
  };

  return (
    <>
      <Header />
      {
        languageContext.language === 'English' ?
          <div className='preface' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
            <div className='p-title' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>Preface</div>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>On the home screen, you can browse your available textbooks and select one to start reading.
              You can also easily search for specific topics, keywords, or pages, as well as access your bookmarked
              pages and notes. In the textbook screen, you can navigate through the pages by swiping or tapping. The
              app allows you to highlight important information and take notes, making studying and learning more
              interactive and efficient. With Textbook Pro,
              you'll have all your textbooks in one convenient place, accessible anytime and anywhere.</p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>On the home screen, you can browse your available textbooks and select one to start reading.
              You can also easily search for specific topics, keywords, or pages, as well as access your bookmarked
              pages and notes. In the textbook screen, you can navigate through the pages by swiping or tapping. The
              app allows you to highlight important information and take notes, making studying and learning more
              interactive and efficient. With Textbook Pro,
              you'll have all your textbooks in one convenient place, accessible anytime and anywhere.</p>
          </div> :
          <div className='preface' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
            <p
              className='p-title'
              style={{
                fontFamily: getFontFamily(),
                fontSize: `${context.fontSize + 2}px`
              }}
            >
              முன்னுரை
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              <span className='font-weight'>இம் மொழி பெயர்ப்பு பற்றி ...</span>
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              <span className='font-weight'>இதுவே புத்தகம். </span>இது மட்டுமே புத்தகம். இது  புத்தகமாகும். அகத்தைப் புத்தம் புதிதாக ஆக்குவதன்  காரணமாக, அதாவது புதிய அகமாக ஆக்குவதன் பண்புகள் காரணமாக இது புத்தகமாகும். இது ஒரு மனிதனின் பண்புகளை தூய்மைப் படுத்தி, இறைவனுடைய பண்புகளுக்குப் பொருத்தமானதாகப் பக்குவப்படுத்துகிறது. இந்தப் புத்தகத்தின் ஒவ்வொரு வசனமும் இறைவனோடு நெருங்கி இணையக் கூடிய சிகரத்திற்கு சிந்தனையை மேன்மைப்படுத்துகிறது. அந்த சிந்தனையின் சிகரத்திலேயே இருதயத்தின்  நம்பிக்கையையும் ஒரு சிறிதும் சந்தேகத்திற்கு  இடமில்லாமல் நிலை நிறுத்துகிறது. இது புத்தகம்.</p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இந்தப் புத்தகத்தின் அத்தாட்சிகள் ஒவ்வொன்றும் இம்மையையும், மறுமையையும் இணைக்கக் கூடிய பாலம் ஆகும். இதன் வாசகங்களுடைய சான்றுகள் உலகம் தோன்றுவதற்கு முன்பிருந்து இவ்வுலகம் முடிவுற்றதற்குப் பின்பு தொடரும் நிகழ்ச்சிகள் வரையில் ஆணித்தரமாக வரையறுக்கப்படுவதாக இருக்கிறது. உலகத்தில் வாழ்பவர்களுக்கு மட்டுமல்ல, இப்புத்தகமானது அகிலத்தாருக்கு ஒரு பேரருட்கொடையாகும். வானங்களுக்கும், பூமிக்கும்; இவ்விரண்டிற்கும் இடையேயும் உள்ள அனைத்துப் பொருள்களுக்கும் இந்தக் குர்ஆனில் உள்ள திட்டங்கள் விளக்கப்பட்டிருக்கின்றன.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இவை அனைத்துமே மனிதனோடு இணைந்து இயங்க வேண்டும். மனிதனும்
              இறைவனின் நியதிக்கு உட்பட்டு வாழ வேண்டும். மனிதன் இறை திட்டங்களுக்கு கட்டுப்படுவானேயானால், வானங்களும், பூமியும் மனிதனுக்கு அடிபணிய வேண்டும். ஆனால், மீறுவானேயானால் விதிக்கப்பட்டது அவன் மீது நிகழ்ந்தே தீரும். வானங்களும், பூமியும் மனிதனுடைய செயல்களுக்கு தக்கக் கூலி கொடுப்பதற்காகவேயன்றி படைக்கப்படவில்லை, எனவே, குர்ஆனை மொழியாக்கம் செய்யும் பொழுது, அதனுடைய ஒட்டுமொத்த முழு அர்த்தத்தையும் மனிதனுடைய சிந்தனைக்கு ஊட்டமளிக்கக் கூடிய வகையில் அமைய வேண்டும். மொழியாக்கத்தினுடைய கருத்துக்கள் முக்காலத்திற்கும் பொருந்தக் கூடியதாக அமையப் பெற வேண்டும்.  அதாவது, அகிலங்கள் படைக்கப்படுவதற்கு முன்பும், யுகம் முடியும் வரையில் நிகழ்ந்து கொண்டிருக்கக் கூடிய அகிலங்களின் அமைப்புக்கும், யுக முடிவுக்குப் பின் இறைவன் படைக்க இருக்கக் கூடிய நிரந்தரமான வாழ்க்கைக்கும் ஆக முக்காலத்தும், எக்காலத்தும்  பொருந்தக் கூடியதாக குர்ஆனுடைய மொழியாக்கம் அமைய வேண்டும். இது மனிதர்களால் சாத்தியமல்ல. யாருக்கு இறைவன் தன் புறமிருந்து ஞானத்தை அளித்திருக்கின்றானோ, அவருக்கு மட்டும்தான் குர்ஆன் மொழியாக்கம் சாத்தியம் என்பதை நாம் அறிய வேண்டும்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              மொழியாக்கத்தை ஆரம்பிப்பதற்கு முன்பாக முக்கியமாக இரண்டு வார்த்தைகளை இந்தத்
              தருணத்தில் நாம் தெளிவாக அறிய வேண்டியவர்களாக இருக்கின்றோம்.
              <span className='font-weight'>1. அல்லாஹ், 2. குர்ஆன்.</span>
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              <span className='font-weight'>1. அல்லாஹ்</span> -  இந்த வார்த்தையின் பொருளாவது, ஒருபோதும் பார்க்கவே முடியாத இறைவன் என்பதாகும்.
              மனித இனம் படைக்கப்பட்ட நாள் முதலாக இறைவனை யார் பார்த்தது என்று கேட்டால், 'எவரும் பார்த்தது இல்லை' என்பதுதான் பதிலாக இருக்கும். இனியும் பார்க்க முடியுமா என்று கேட்டால், 'ஒருக்காலும் முடியாது' என்பதே பதிலாக இருக்கும். எனவே, அல்லாஹ் என்பது, இறைவன் என்பது, தெய்வம் என்பது, ஆண்டவன் என்பது அனைத்துமே உணர்ந்து மட்டுமே அறிய முடியுமே தவிர, உருவமாக இந்தக் கண்களைக் கொண்டு பார்ப்பது என்பதற்கே இல்லை. ஆகவே நாம் தெய்வ உணர்வோடு, ஆண்டவன் என்ற உணர்வோடு, இறைவன் என்ற உணர்வோடு, அல்லாஹ் என்ற உணர்வோடு மட்டுமே அவனை, அந்த மகா சக்தியை, அந்தப் பேரருளாளனை, அந்தப் படைப்பாளனை நினைவுகூர்ந்து, அந்த சத்தியத்தைக் கொண்டும், அதனளவிலான பொறுமையைக் கொண்டு வாழ்வது மட்டும்தான் இறைவன் திருப்பொருத்தத்தை நாடி வாழக் கூடிய வாழ்க்கையாகும். இத்தகையோரையே இறைவன் பொருந்திக் கொள்கிறான்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              எனவே, அல்லாஹ் என்ற அந்தப் பதத்தை உணர்வுகளால் உணர்ந்து, உள்ளச்சத்தோடு வாழ்வது -
              அதாவது, மனசாட்சிக்கு விரோதமில்லாமல் வாழ்வதே தெய்வத்திற்கு வழிபடுவதாகும்; இதுவே
              இறைவழிபாடாகும். அல்லாஹ் என்பதனுடைய பொருள் ஒருக்காலும், ஒருபொழுதும் ஒரு பொருளாக
              பார்க்கவே முடியாத உங்களுடைய இறைஞ்சுதலுக்கு தகுதி படைத்தவன், அந்த இறைவன்.
              அதுவே அல்லாஹ் என்பதை நாம் அறிந்து கொள்வோமாக.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              <span className='font-weight'>2. குர்ஆன்.</span> - குர்ஆன் என்பதன் பொருள் The Reading எடுத்தோதுதல் - அதாவது வாழ்க்கை நெறியை
              எடுத்துக்காட்டுகளைக் கொண்டு அறிவுறுத்துதல் ஆகும். குர்ஆன் இறைவேதமாக இருக்கிறது. எனவே
              அதில் அவன் தன்னைப் பற்றி, தன்னுடைய குணங்களைப் பற்றி, தான் யார் என்பது பற்றி தெளிவாக
              தன் பண்புகள் அனைத்தையும் அதில் மனிதர்களுக்கு இவ்வாறு உணர்த்துகிறான்: மகா சக்தி, ஆற்றல்
              மிக்கவன், படைப்பாளன், உணவளிப்பவன், கருணையாளன், மன்னிப்பவன், அளவற்ற அருளாளன்,
              இரக்கமுடையவன், தண்டிப்பதில் கடுமையானவன், தயை மிக்கவன் -  இன்னும் தன்னைப் பற்றி
              அனைத்துப் பண்புகளையும் வேதத்தில் தெளிவாக்கியிருக்கின்றான். குர்ஆன் - The Reading  என்பது
              சத்தியத்தை சிந்தித்து, உணர்ந்து, ஏற்று செயல்படுவதும், அதன் தூய்மையான நற்செய்திகளையும்,
              நல்லுபதேசங்களையும் அதன் விளக்கங்களையும் கொண்டு உள்ளத்தை உறுதிப்படுத்துவதாகும்.</p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இன்னும் சிந்தனைக்கும், அதன் ஆற்றலுக்கும் வழிவகுத்து ஒவ்வொருவரின் வாழ்க்கையையும்
              மேன்மைப்படுத்தக் கூடியதாக படைப்பாளனால் அமைக்கப்பட்டிருந்தால், அது குர்ஆன்.
              நல்லுபதேசங்களை ஏற்று வாழத் தவறினால், இறைவனிடமிருந்துள்ள கடுமையான தண்டனையைக்
              கொண்டு எச்சரிக்கை செய்யக் கூடியதாகவும், அதே சமயம் அதனை ஏற்று நடப்பவர்களுக்கு
              பேரொளியாகவும், பேரருளாகவும் இந்த சத்தியம் அமையும் என்பதை உறுதிப்படுத்துவதாகவும் -
              ஆகிய இவ்வனைத்தையும் உள்ளடக்கி இருக்கக் கூடிய ஒரு பதம்தான் குர்ஆன் - The Reading
              என்ற அரபி வார்த்தையாகும்.</p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              மேற்சொன்ன இறைவனுடைய அனைத்துப்  பண்புகளையும் உள்ளடக்கியதும், நல்லுபதேசங்களும்,
              நற்செய்திகளும், எச்சரிக்கைகளும், நேர்வழியும், சத்தியமும் ஆகிய இவை அனைத்தையும்
              உள்ளடக்கிய ஒரு வார்த்தை உலக மொழிகளில் இல்லை என்றே சொல்லலாம். அப்படி
              ஒன்று இருந்தால், குர்ஆன் என்ற வார்த்தைக்கு பதிலாக நிச்சயமாக பயன்படுத்தலாம்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              ஆனால், உலகளவில் இன்று இருக்கக் கூடிய மொழிபெயர்ப்புகள் அனைத்தும் 1,500 வருடங்களுக்கு
              முன்பு இருந்த சம்பவங்கள், நிகழ்ச்சிகள், செய்திகள் போன்றவற்றின் கற்பனைகளுக்குள்
              அடங்கியவையாகவே உள்ளன. எனவே, இவ்வுலக வாழ்க்கையில் இன்றைக்கோ, அல்லது
              நாளைக்கோ எவ்வித பொருத்தத்திற்கும் ஏற்புடையதாக அல்லது வழிகாட்டியாக அமைவதற்கு
              சாத்தியமே இல்லை. எனவே, இந்தக் குர்ஆன்  மொழியாக்கம் இறைவனுடைய ஞானங்கள்
              கற்பிக்கப்பட்டது கொண்டு முக்காலத்தும், எக்காலத்திற்கும் மிகவும் பொருத்தமான, மனித
              உணர்வுகளுக்கு சுகமான, சங்கையான வாழ்வுக்கும்” வழிவகுக்கக் கூடிய மனிதர்களின் உள்ளங்களை
              சிகரங்களில் அமைக்கக் கூடிய பாங்கில் நிச்சயமாக இறைவன்! இதை அமைத்திருக்கின்றான் என்பதை
              இந்த மொழியாக்கத்தைப் படிக்கக் கூடிய ஒவ்வொருவரும் அறிவார்கள், ஒவ்வொரு இறை வாசகத்தின்
              மொழியாக்கமும் இறைவனிடத்தில் நெருங்கக் கூடிய சிந்தனையைத் தூண்டும் என்பதும் சந்தேகமில்லை.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              சிந்தனை எண்ணங்களின் அளவில் எழும் நிகழ்ச்சிகள் ஆகும். நம்மை எழுப்பும் நிகழ்ச்சிகள் ஆகும். இந்தப் புத்தகம் சிந்தனைகளைக் கொண்டது. சிந்தனை ஆற்றலைக் கொண்டது. 'சிந்தனை ஆற்றல்' என்பது மறைவான எண்ணங்களை, ஐம்புலன்களுக்கும் ஐஸ்வரியமாகச் செய்யக் கூடிய செயலாற்றலாகும். அகத்தின் அசைவுகளைப் புறத்தில் நிகழ்த்தக் கூடிய மகத்தான ஆற்றலைக் கொண்டதாகும். இது இறையாற்றலின் பகுதி ஆகும். இறையாற்றலை நம் அகத்தில் நம்பிக்கையாற்றலாக உறுதிப்படுத்துவது இந்தப் புத்தகத்தின் ஆற்றலாகும்.</p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              நம்பிக்கை கொண்டோருக்கு இது ஒரு பேரருட்கொடை. சிந்தனையை நம்புவோருக்கே சிந்தனையாற்றல். இப் புத்தகத்தில் உள்ள வசனங்கள் ஒவ்வொன்றும் இந்த வகையில் தெளிவான சான்றுகள் பொதிந்த அத்தாட்சிகளாகும். நம்பிக்கை கொண்டோருக்கு அதனை விளக்குவதும், பின்னர் அதை இருதயத்தில் உறுதிப் படுத்துவதும் இறைவன் மீதே . கடமையாகிறது. எனவே மனிதர்களிடமிருந்து இறைவனிடம் பாதுகாவல் தேடியவர்களாக இந்தப் புத்தகத்தைப் படியுங்கள். இதைப் புரிந்து கொள்ள, நம்பிக்கை கொள்ள, ஆற்றல் பெற சிந்தனை தான் ஒரே வழி. மொழி அல்ல.</p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இந்தப் புத்தகத்திற்கு 'சிந்தனை' என்ற பெயரும் உண்டு. எனவே சிந்தனை உடையோருக்கே இதன் வசனங்கள் வேத வசனங்களாகப் புலப்படும். சிந்தனை சக்தி உடையோர் யாரெனில், சிந்தனையில் புலனாகும் ஒவ்வொன்றும் இறைவன் அனுமதியைக் கொண்டும், அவன் அனுக்கிரஹத்தைக் கொண்டும் தானாக புற வாழ்க்கையில் அமையப் பெறும் என்ற அத்தாட்சியையும் தெளிவாக உணர்ந்துள்ளோர் தாம். இத்தகையோர், பாதையில் உங்களை உறுதியாக நிலை பெறச் செய்வது தான் 'சிந்தனை' எனும் இந்தப் புத்தகத்தின் சிறப்பு.</p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              சிந்தனை இறை மொழியாகும். மனித சமுதாயத்தின் மறை மொழியாகும். எனவே இது மட்டுமே மனித சமுதாயத்தின் பொது மொழியுமாகும், இந்தப் புத்தகம் அரபி மொழியில் அமைந்திருப்பதன் காரணமாக அரபு மொழி கற்றோருக்குத் தான் இது புரியும்;  அவர்களிடமிருந்து தான் இப் புத்தகத்தின் வசனங்களைப் பற்றித் தெரிந்து கொள்ள வேண்டும் என்ற தவறான போக்கு இனி இருக்காது. சாதாரணமான ஒரு மொழி பெயர்ப்பே போதும். இப்போது சிந்தனை ஒன்றின் மீது மட்டுமே நம்பிக்கை கொள்ளுங்கள். சிந்தனை எனும் புதுமையான இறை மொழியின் ஆற்றல், மனித மொழிகளில் பெயர்க்கப்பட்ட வசனங்களை மொழி ஆக்கம் செய்யும்.</p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              எனவே இப் புத்தகம் மனித மொழியைக் கொண்டதல்ல; மாறாக இறை வழிகாட்டுதலைக் கொண்டுள்ள, மாபெரும் அத்தாட்சிகளையும், தெளிவான சான்றுகளையும் கொண்டுள்ள பிரித்தறிவிக்கும் நேர்வழியாகும். இந்த மூன்றையும் கொண்டு பிறக்கும் உயர்வான வழிகளே குர்ஆன் ஆகும்.</p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இப் புத்தகத்தின் வசனங்களை சிந்தித்து ஆராயும் போது ஒரு மனிதனின் வாழ்க்கையில் உள்ள நன்மை, தீமைகளைத் தெளிவாகப் பிரித்து அறிய முடிவதைப் பார்ப்பீர்கள். மனிதர்களிடமிருந்து இதுவரை நீங்கள் உணர முடியாததை இதன் அத்தாட்சிகள் உங்களுக்கு உணர்த்துவதை நீங்கள் காண்பீர்கள். இதன் அத்தாட்சிகளை, இன்னும் சிந்திக்கும் போது, உணர்ந்துள்ள உண்மைகளை இன்னும் இன்னும் உறுதியாக்கும் தெளிவான சான்றுகள் அடுக்கடுக்காக இருதயங்களில் இறங்கும். இதனைக் கொண்டு உங்கள் இருதயங்கள் நேர்வழியில் உறுதியாக நிலைத்து விடும். அதாவது, குர்ஆனிலிருந்து ஒரு அத்தாட்சி உங்கள் இருதயத்தில் உங்கள் இறைவன் இறக்கியருள்கிறான்.</p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இந்த இடத்தில் இறைவன் யார் என்பதை நாம் அறிய வேண்டும். பெரும்பாலும் இறைவனை பற்றி குறிப்பிடும் பொழுது
              இறைவனை, 'அவன்' என்று குறிப்பிடுகின்றோம். அவன் என்ற சொல்லுக்கும் தன்னிகரில்லாதது  என்று பொருள். உதாரணமாக ஒரு ஊரில் ஒரு அரசன் இருந்தார் என்று கூற மாட்டோம். இருந்தான் என்றுதான் கூறுவோம். இதனுடைய பொருள் அர்த்தம் இப்பொழுது நமக்குப் புரிகிறது. மிகவும் சிறப்பு வாய்ந்ததாக நாம் கருதும் பொழுது, அவர் என்ற  சொல்லுக்கும் மேலானது அவன் என்ற சொல் ஆகும்: இறைவனுக்கு நிகராக ஒருவரும், இன்னும் எதுவும் ஈடு இணையாகாது என்பதன் காரணமாக அந்த மகத்தான சக்திக்கு 'அவன்' என்ற சொல்தான் பதமான வார்த்தையாகும்.</p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இந்த வார்த்தைக்கு நிகரும், இணையும் படைக்கப்பட்ட எந்தப் பொருளுக்கும்,
              எந்த உயிரினத்திற்கும், எந்த மனிதருக்கும் கிடையாது. எனவே, இவற்றின் அடிப்படையில்
              'அவன்' என்ற பதத்திற்கு பொருள் வடிவம் கொடுக்கக் கூடாது; அதாவது எந்த உருவ வடிவமும்
              கொடுக்கக் கூடாது. இதுதான் இந்தக் குர்ஆனில் இறைவனைப் பற்றி நாம் படிக்கும் பொழுது
              மனதில் கொள்ளக் கூடிய ஒரு எச்சரிக்கையாகும். இவ்வகையிலான உணர்வுடன் படிக்கும் பொழுது,
              இறைவன் ஆணா? அல்லது பெண்ணா? அல்லது அஃறினையா என்ற மனிதனுடைய அனைத்துக்
              கற்பனைகளுக்கும் மேலான ஒரு மகா சக்தியாக, இருக்கிறது, இறைவன் என்ற வார்த்தை.
              இந்த உணர்வுதான் இறைவனைப் பற்றி நாம் அறிவதற்கும், அவனை ஏற்பதற்கும், அவனைப்
              பின்பற்றுவதற்கும் உள்ளத்திற்கு சுகமான, பிரகாசமான வழிப்பாதை..</p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இனி உங்களை உங்கள் இறைவனின் பாதையிலிருந்து மாற்றுவோர் எவரும் இல்லை.
              அதாவது உங்கள் சிந்தனையாற்றலின் மீதுள்ள தெளிவான நம்பிக்கையை மனிதர்களின்
              அற்பமான உலக அறிவு மிகைத்து விடாது. இத்தகையோரே மனித அறிவின் தாழ்ந்த தரத்தின்
              பாதையிலிருந்து, சிந்தனை எனும் தூய்மையான பாதையின் பால் தங்களை உயர்த்திக்
              கொண்டவர்கள். இவ் வகையில் தூய்மையானவர்களைத் தவிர, இப் புத்தகத்திலிருந்து குர்ஆனைப்
              பெறவும் முடியாது; குர்ஆனை நெருங்கவும் முடியாது; ஏனெனில் இந்தப் புத்தகத்தின்
              வாசகங்களை சிந்திக்கும் போது, மனிதர்களின் வாழ்க்கைப் போக்குகளின் தவறான, கேடான,
              துரோகமான பாதைகளிலிருந்து விலகி, இறையுணர்வுகளின் பால் நம்பிக்கை கொண்டவர்களாக
              உயரும் போது மட்டுமே இறைவனின் அனுமதியைக் கொண்டு சிந்தனையாற்றல், தெளிவான
              சான்றுகளுடன் அசைக்க முடியாத நம்பிக்கை எனும் இறை முத்திரையுடன் இருதயத்தில்
              இறங்குகிறது. இவர்களே தூய்மையானவர்கள். தூய்மையானவர்களைத் தவிர இப்
              புத்தகத்திலிருந்து குர்ஆனைத் தொடவும் முடியாது; அதனை நெருங்கவும் முடியாது. </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              குர்ஆனை இறைவன் தூய்மையானவர்களின் இருதயத்தில் இறக்குகிறான். தூய்மையானவர்கள்,
              தங்கள் இறைவன் உண்மையாக, தெளிவான அத்தாட்சிகளுடன் எதை இறக்கியருள் செய்தானோ,
              அதனைத் தவிர வேறெதனையும் தங்களின் இவ்வுலக வாழ்க்கையின் வழியாக நம்பிக்கை
              கொள்ளவும் மாட்டார்கள்; ஏற்று நடக்கவும் மாட்டார்கள். தங்கள் மூதாதையர்களையும் பின்பற்ற
              மாட்டார்கள். தங்கள் சமூகத்தாரையும் பின்பற்ற மாட்டார்கள். மதச் சடங்குகளிலும்,
              மனிதர்களின் வீணான வழிமுறைகளிலும் சிக்கிச் சீரழிய மாட்டார்கள். பிற வணக்க வழிபாட்டு
              முறைகள், தொழுகை அனைத்தும் மனிதர்களுக்கு தங்கள் இறைபக்தியைக் காட்டுவதாகும்.
              இத்தகைய வழிபாடுகளால் மனிதர்களுக்குக் கேடு தான் என்று இறைவன் சபிக்கிறான்.</p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              <span className='font-weight' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
                தொழுகை என்றால் என்ன?
              </span>
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              உண்மையான தொழுகையாளிகள் யாரென்றால் தங்கள் சிந்தனையில் தங்கள் இருதயத்தில்
              எதை உறுதியான நன்மையாக இறைவன் இறக்கி வைத்தானோ, அதனையே பின்பற்றுவார்கள்.
              இதுவே தொழுகை. மறைவான தொழுகை. உள்ளத்தை அறியும் இறைவனால் மட்டுமே
              அறியப்படக் கூடிய தொழுகை. இத்தகைய தொழுகையே இறைவனால் அங்கீகரிக்கப்படும்
              தொழுகையாகும்.  இத்தகைய தொழுகையாளிகளையே இறைவன் நேர்வழிக்குரியவர்களாக
              தேர்ந்தெடுத்துக் கொள்கிறான்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              <span className='font-weight'>
                சிந்தனை ஒன்றே இறை மொழி
              </span>
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              தொழுகைக்கானப் பொருள் சத்தியத்திற்கு புறம்பாகவும், உண்மைக்கு மாறாகவும் உங்கள்
              வாழ்க்கையில் நடக்க வேண்டாம் என்பதாகும். இப் புத்தகத்தின் அத்தாட்சிகள் கொண்ட
              ஒவ்வொரு வசனத்தின் ஒவ்வொரு வார்த்தையும் பல நூறாயிரம் பொருள்களைக் கொண்டதாக
              இருக்கிறது. ஒரு வார்த்தைக்கு ஒரு பொருள் தான் என்பது மனித மொழியின் இலக்கணம்.
              இந்த புத்தகமோ இறை மொழியாகும்.
              <span className='font-weight'>சிந்தனை ஒன்றே குர்ஆனுடைய மொழியின் இலக்கணம். </span>
              சிந்தனைக்கு எல்லையில்லை.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              எனவே, இறை மொழியின் ஒவ்வொரு வார்த்தைக்கும், ஒவ்வொரு வசனத்திற்கும்
              எல்லையில்லாத பொருளும், அர்த்தமும் உண்டு. சந்தர்ப்பத்தின் அடிப்படையிலும்,
              சூழ்நிலைகளின் அடிப்படையிலும், நிகழ்வுகளின் அடிப்படையிலும் எக்காலத்தும் அந்தந்த
              சமுதாயத்தின் நிலைமையின் அடிப்படையிலும் பொருளும், விளக்கமும் மாறும். எனினும்,
              அவை ஒன்றுக்கொன்று ஒப்பானதாகவும், திரும்பத் திரும்ப நினைவு கூரக் கூடியதாகவும்,
              குர்ஆனின் ஒரு வார்த்தைக்கு ஒரு சூழ்நிலைக்கு அமைந்துள்ள பொருளுக்கும், அதே வார்த்தை
              வேறொரு சூழ்நிலைக்கு அளிக்கக் கூடிய மற்றொரு பொருளுக்கும் முரண்பாடாக அமையாது.
              குர்ஆனுடைய விசேஷமான தன்மை இது தான். அதாவது,
              <span className='font-weight'> ஒவ்வொரு அத்தாட்சிகள் பொருந்திய
                வசனமும் விரிவாக்கம் பெறக் கூடியதாகும்</span>.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இப் புத்தகத்தைப் படிப்பவர்கள், தங்கள் மனித மொழி அறிவை மட்டுமே நம்பி, வசனங்களாகப்
              படிப்பார்களானால், தொழுகை என்பது மனிதக் கண்களுக்கு அறியப்படும் வெளிப்படையான
              சடங்குகளாகவே அமையும். எனவே, அத்தகையத் தொழுகைகளில் உள்ளச்சமோ, உள்ளார்த்தமோ
              இருக்காது. பிறருக்குக் காண்பிப்பதே தவிர, இறைவன் அதைப் பொருட்படுத்த மாட்டான்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இப் புத்தகத்தின் எந்த ஒரு சொல்லுக்கும் அகராதியின் அடிப்படையிலான பொருள் கொள்வது
              அநீதம் ஆகும்.  ஒரு பதத்திற்குப் பொருள் கொள்ளும் போது அப் பொருளின் கருத்தும்,
              ஆக்கமும் அவசியம். அர்த்தமுள்ள வாழ்க்கையை வாழ்வதற்காகவே ஒரு சொல்லுக்கான
              அர்த்தம் தேவைப்படுகிறது. அதுவே அப் பதத்தின் அல்லது, அச் சொல்லின் உயிரோட்டம்.
              அவ்வாறு இல்லையெனில், அப் பதம் குறித்து ஒரு வெற்றுச் சடங்காக, இப்பொழுது விதவிதமான
              தொழுகை உள்ளது போல் ஒரு மதச் சடங்காக ஆக்கப்பட்டு விடும். அந்த மதச் சடங்குகளில்
              உங்களுக்கு இறை நம்பிக்கையும் பெருகாது; இறையருளும் இல்லை; மதச் சடங்குகளைக்
              கற்பிக்க, தலைவர்களும், மத குருமார்களும் களைகளாக முளைத்துக் கொண்டேயிருப்பார்கள்.
              மனிதன் என்ற ஒரே சமுதாயம் எவ்வாறு ஆயிரக்கணக்கான பிரிவினர்களானார்கள்; ஒவ்வொரு
              பிரிவினரும் தங்களுக்குள் கடும் விரோதிகளாக வாழ்ந்து கொண்டு இருக்கிறார்கள் என்பதற்கான
              தெளிவான சான்று இதுவேயாகும். உங்களைப் படைத்த இறைவனே உங்களுக்கு தன் வேதத்தின்
              பால் வழிகாட்டுவான் என்பதை எப்படி நீங்கள் புறக்கணித்தீர்கள்? அல்லது மறதியில் ஆகி
              மனிதர்களை நேர் வழிகாட்டும் இமாம்களாக ஆக்கிக் கொண்டீர்கள்? நீங்கள் மனித
              சமுதாயமாக ஆக ஒரே வழி உங்கள் வேதத்தை நீங்கள் ஓதிப் பழகுங்கள். அதில் வாழ்க்கை
              வழிமுறைகளுக்குப் புரியாததை - அதனை உங்களுக்கு வாழ்க்கை வழிமுறையாக்கி
              இயற்றியருளிய அல்லாஹ்விடமே கேளுங்கள். உங்களுக்கு வழி காட்டுபவன் அவனைத்
              தவிர வேறு வழிகாட்டி இறைவன் இல்லை.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              <span className='font-weight'>இந்தப் புத்தகம் இறைவனால் இறக்கியருளப்பட்டது  என்பதை எவ்விதம் நம்புவது? </span>
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இதன் வசனங்கள் ஒவ்வொன்றும் சிந்தனையைத் தூண்டும். மனித மொழி அறிவுகளுக்கு
              அப்பால் எடுத்துச் செல்லும். மனிதர்களின், மனித விரோதமும் இறை துரோகமுமான தவறான
              வழிமுறைகளின் கேடுகளிலிருந்து உங்களை விலக்கவும் செய்யும்; உங்களுக்கு எச்சரிக்கையும்
              செய்யும். இதனை மீறியதன் காரணமாகவும், நீங்கள் உங்கள் கைகளால் சம்பாதித்துக் கொண்ட
              உங்களுடைய பிரச்சினைகளின் காரணமாக உதவியற்றவர்களாக ஆகி விடும் பொழுது, பெரும்
              துக்கத்தில் மூழ்கும் பொழுது, இப் புத்தகத்தின் வசனங்களைப் படிப்பீர்களானால், நிச்சயமாக
              மனதின் ஆறுதல் உண்டு; இன்னும், தெளிவானப் பாதையும் உண்டு. மேலும், இதன் வசனங்கள்
              அதிலிருந்து நீங்கள் பாதைகளை சிந்தனையின் வாயிலாக அறியும் பொழுது, நாளைய
              வாழ்க்கையைப் பற்றி நிம்மதியும், அமைதியும் நிலைக்கும். மனம் அமைதியும், சமாதானமும்
              பெறும்.  மனதின் மீது நிச்சயமாக மனிதனுக்கு எந்தவிதமான கட்டுப்பாடும் கிடையாது.
              மனதின் மீது மனிதனுக்கு எவ்விதமான அதிகாரமும் கிடையாது. உதாரணமாக, ஒரு கவலை
              மனதைத் தீண்டி விட்டால், எவ்வளவு முயன்றாலும் அவனால் அதை நீக்கிக் கொள்ள முடியாது.
              'இறைவனே!' என்று திரும்புவான். கவலையை நீக்குவதும், சாந்தத்தையும், சமாதானத்தையும்
              அளிப்பதும் இறைவன் தன் ஆற்றலையும், பாக்கியங்களையும் கொண்டு ஒரு மனிதனின்
              இருதயத்தில் இறக்கி அருளுவதாகும். இப் புத்தகத்தின் வசனங்களை நீங்கள் படித்துக் கொண்டு
              வரும் பொழுது, உங்களுடைய மனதிற்கு அமைதியும், நிறைவும் நிச்சயமாக ஏற்படும்.
              அறிந்து கொள்ளுங்கள், மனதின் மீது ஆதிக்கம் படைத்தவன் இறைவன் ஒருவன் தான்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              எனவே, இப் புத்தகத்தின் வசனங்கள் சத்தியத்தையும், உண்மையையும்; நேர்மையையும்;
              நீதத்தையும், சாந்தத்தையும், சமாதானத்தையும்; அமைதியையும், நிம்மதியையும் படைக்கும்
              பாதையைக் காட்டுவதன் காரணமாக, நிச்சயமாக இது இறைவனிடமிருந்து தான் என்பதன்
              மீது எந்த சந்தேகத்திற்கும் இடமில்லாமல் தெளிவுக்கு வழி வகுக்கும்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இப்புத்தகத்தின் வசனங்கள் ஒன்றுக்கொன்று முரண்படாததாக இருக்கிறது. மேலும்
              மனசாட்சியத்திற்கு முரண்படாததாகவும், சத்தியத்தைச் சார்ந்ததாகவும், நியாயம்
              நேர்மைக்குக் கட்டுப்பட்டதாகவும் அமைந்திருப்பது இந்தக் குர்ஆன் இறைவாக்குகள்
              கொண்டது என்பதற்குப் போதுமான சாட்சியமாக இருக்கிறது.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}><span className='font-weight'>இப் புத்தகத்தை எப்படிப் படிப்பது? </span></p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              ஒவ்வொரு நாளும் உங்களுக்குப் பிரச்சினைகள் உண்டு.  தூங்கி எழும் பொழுது, நேற்றைய
              பிரச்சினைகள் கவலையைத் தொடரச் செய்யும். இன்றைய வாழ்க்கையின் ஆரம்பம்
              கவலையையும், பயத்தையும் கொள்ளச் செய்யும். இன்னும், மனித விரோதத்தின் பாதையிலும்,
              இறை துரோகத்தின் பாதையிலும் உங்களுக்கு நீங்கள் இவ்வுலகத்தில் ஆக்கிக் கொண்ட
              வழிமுறைகளின் கேடுகளால் விளையக் கூடிய பிரதிபலன்களைக் கொண்டும் அச்சமும்,
              விரக்தியும் கொண்டிருப்பீர்கள். எனவே, இனி உங்களுக்கு மனிதர்களுடைய உதவியும் இல்லை;
              பாதுகாப்பும் இல்லை. அனைத்து வழிகளும் மூடப்பட்டு விட்டன.  இனி, இறைவழி ஒன்று தான்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இந்த நிலையில் நீங்கள் உங்கள் புத்தகத்தை எடுங்கள். இந்த நிலையில் தான் அதாவது,
              மனிதர்களுடைய வழிமுறைகள் அனைத்திலிருந்தும் கேடுகளைச் சம்பாதித்துக் கொண்டு,
              பின்னர் திகைத்து வழியறியாத நிலையில் இந்தப் புத்தகத்தின் பக்கம் திரும்பும் போது,
              நிச்சயமாக இறைவன் ஒருவனுடைய துணையும், அவன் பாதுகாப்பும் உங்களுக்கு இருக்கிறது.
              உங்களுடைய மனதிற்கு ஆறுதலை அளிக்க நிச்சயமாக இந்தப் புத்தகத்தின் வசனங்களை
              நீங்கள் படிக்கும் பொழுது, அதன் விளக்கங்களைத் தன் புறத்திலிருந்து
              <span className='font-weight'> ‘குர்ஆனாக - நேர்வழிகாட்டியாக’ </span> உங்கள் இருதயத்தில்
              இறக்கியருள்வான். உங்கள் மனம் இலேசாகும்; அமைதியடையும். எனவே,
              இது இறை புத்தகம். மறைவான பொக்கிஷங்களையும், அருட்கொடைகளையும் கொண்டிருக்கும்
              பொதுமறை.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இப் புத்தகத்தின் வசனங்களைப் படிக்கும் பொழுது, மனித வழிமுறைகளிலிருந்து உங்களை
              முற்றிலுமாக நீக்கிக் கொண்டவர்களாக, முற்றிலுமாகப் புதியதொரு பாதையின் மீது ஆதரவு
              வைத்தவர்களாகப் படியுங்கள். இது சிந்தனையின் பாதையாகும். ஒவ்வொரு வசனமாகப்
              படித்துக் கொண்டு வரும் பொழுது, பல வசனங்கள் உங்களுக்குப் புரியாது. அல்லது, மிகவும்
              சாதாரணமானது தானே என்று தோன்றும். இன்னும் தொடருங்கள். மேலும், வசனங்களைப்
              படியுங்கள். ஒரு குறிப்பிட்ட வசனத்தில் அல்லது, சில குறிப்பிட்ட வசனங்களில் உங்கள் கவனம்
              ஈர்க்கப்பட்டு விடும். அந்தக் குறிப்பிட்ட வசனங்கள் தான் அல்லது, வசனம் தான் அன்றைய
              உங்களுடைய வாழ்க்கைக்கானத் தொழுகை வழிமுறையாகும்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              அந்தக் குறிப்பிட்ட வசனங்கள் உங்கள் கவனத்தை ஏன் ஈர்த்தன என்றால், உங்களுடைய
              பிரச்சினைகளுக்கு உரிய தேடுதல் உங்களுடைய உதவிக்கான தேடுதல் நீங்கள் மனதில்
              கொண்டிருந்தீர்களே, அந்தத் தேடுதலின் காரணத்தால், அந்த குறிப்பிட்ட வசனத்தின் பால்
              நீங்கள் ஈர்க்கப்பட்டு விட்டீர்கள். அந்த வசனத்தை எழுதிக் கொள்ளுங்கள், அல்லது,
              மனப்பாடம் செய்து கொள்ளுங்கள். மனப்பாடம் செய்யப்பட்ட அந்தப் பகுதியை அடையாளம்
              வைத்து, புத்தகத்தை மூடி விடுங்கள்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இப்பொழுது, எந்த வசனத்தை மனப்பாடம் செய்தீர்களோ, அந்தக் குறிப்பிட்ட வசனத்தை
              சிந்திக்கத் தொடங்கும் பொழுது, தியானம் ஆரம்பமாகிறது. தியானத்தில் உங்களுக்கு பலப்பல
              விஷயங்கள் பலப்பல கோணங்களில் உங்கள் இருதயத்திற்கு தெம்பையும், ஆறுதலையும்
              அளிக்கும். அந்த குறிப்பிட்ட வசனங்களின் தியானத்தில் இருக்கும் பொழுது, இதுவரையில்
              நீங்கள் மனித வழிமுறைகளில் நடந்து கொண்ட விரோதம் என்ன? இறை துரோகம் என்ன
              என்பதைத் தெளிவாக அறிவிக்கப்படுவீர்கள். நேற்று வரையில் இருந்த வாழ்க்கையில் பின்பற்றி
              வந்த வழிமுறை இந்தத் தருணத்திலிருந்து உங்களுக்கு மாற வேண்டும். அதாவது, உங்களுடைய
              பண்புகள் மேலோங்குகின்றன. அதன் பிரதிபலிப்பாக மனதின் குணநலன்கள் மாறுகின்றன.
              மாறுபட்ட இந்த மனதினுடைய பண்புகளும், குண நலன்களும் தான் இனி உங்களுடைய
              வாழ்க்கையில் பின்பற்ற வேண்டியத் தொழுகையாகும்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இவ்விதமாக, தொழுகையின் போது உங்களுடைய பிரார்த்தனை மானசீகமாக உங்களுடைய
              இறைவன் பக்கம் நிலைத்திருக்கட்டும்:<span className='font-weight'> " என் இறைவனே, உன்னுடைய நேர்வழியில் என்னை
                அதிகரிப்பாயாக. உன் புறத்திலிருந்து குர்ஆனை எனக்குத்  தெளிவாக்குவாயாக.
                இன்னும், ஞானங்களை அதிகரிப்பாயாக. என் இறைவனே, மனிதர்களின் தீய
                வழிமுறைகளிலிருந்தும் என்னை நீக்கி, உயர்வான பாதைகளில் என்னை வழி நடத்துவாயாக.
                இன்னும், நல்லோர்களின் சமுதாயத்துடன் என்னையும் சேர்த்து வைப்பாயாக” </span>
              என்ற பிரார்த்தனையை, இந்தப் புத்தகத்தை ஓதும் போதெல்லாம் நினைவில் நிறுத்தியவர்களாக,
              உள்ளச்சமும், ஆசையும் கொண்டவர்களாக மனதில் கொள்ளுங்கள்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              உங்களுக்கு மனதில் கஷ்டங்களும், துன்பங்களும் ஏற்படும் போதெல்லாம் எங்கு நீங்கள்
              உங்களுடைய புத்தகத்தில் அடையாளம் முன்பு வைத்தீர்களோ, அந்த இடத்திலிருந்து தொடருங்கள்.
              பல வசனங்கள் உங்களுக்குப் புரியாது. அல்லது, உங்களுக்கு ஏற்கனவே தெரிந்தது தானே என்பது
              போன்று தோன்றும். மேலே படியுங்கள். இறைவன் அனுமதியைக் கொண்டு எந்த வசனத்தில்
              உங்களுடைய கவனம் ஈர்க்கப்பட்டு, உங்களுடைய மனம் நிலைகொண்டு விடுகிறதோ,
              அங்கு அடையாளத்தை மாற்றி வைத்து, அந்த வசனத்தை மனப்பாடம் செய்து கொண்டு
              புத்தகத்தை மூடுங்கள் தியானத்தைத் தொடருங்கள்.<span className='font-weight'> இதுவே நீங்கள் இந்தப் புத்தகத்தை
                அணுக வேண்டிய முறையாகும்.</span>
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              ஒவ்வொரு சமயமும் ஈர்க்கப்பட்ட வசனத்தின் மீது நீங்கள் தியானம் கொள்ளும் பொழுது,
              உங்களுடைய குணநலன்களும், மனதினுடைய பண்புகளும் மேன்மையான மாற்றங்கள் அடைய
              வேண்டும். அது உங்களுடைய வாழ்க்கையில் பிரதிபலிக்க வேண்டும். இன்னும், அது
              உங்களுடைய வாழ்க்கையாக அமைந்து விடவும் வேண்டும். தொழுகையே உங்களுடைய
              வாழ்க்கையாக மாற வேண்டும். ஆனால், இன்று மனிதர்களைப் பார்ப்பீர்களானால்
              <span className='font-weight'> தொழுகையை வாழ்க்கைக்கு சம்பந்தமேயில்லாத ஒரு சடங்காக்கி, தொழுகையை
                வாழ்க்கையிலிருந்து பிரித்து விட்டார்கள்.</span>
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இறைவனைப் பின்பற்ற வேண்டும் என்பது உங்கள் மீதுள்ள கட்டளையாகும். பெரும்பான்மையான
              மனிதர்களுடைய வழிமுறைகளைப் பின்பற்றக் கூடாது என்பது உங்கள் மீது உங்கள்
              இறைவனிடமிருந்துள்ள எச்சரிக்கை.<span className='font-weight'> எனவே, நீங்கள் உங்கள் இருதயத்தில் இறக்கப்பட்டதைப்
                பின்பற்றுங்கள்</span>. உங்களுடைய மூதாதையரின் வழிமுறையையோ, எந்தவொரு சமுதாயத்தின்
              வழிமுறையையோ, எந்தவொரு தனி மனிதரின் வெளிப்படையான வழிமுறையையோ
              பின்பற்றாதீர்கள். ஏனென்றால், வெளிப்படையான வழிமுறை வணக்க வழிபாடல்ல என்பதும்
              இறைவனுடைய நல்லுபதேசமும், எச்சரிக்கையும் ஆகும்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              <span className='font-weight'>உங்கள் இருதயத்தில் இறக்கப்படுபவை என்ன?</span>
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              உங்களுடைய தேவைகள் உங்களுடைய இருதயத்தில் இறக்கப்படுகின்றன. அதை நீங்கள்
              விருப்பம் கொள்கிறீர்கள்.  உங்களுடைய தேவைகள் இருதயத்தில் இறக்கப்படும் அதே சமயம்,
              அதற்கான வழிமுறைகள் தன்னிடம் தவிர, உங்களிடம் இல்லை என்பதையும் இறைவன்
              அறிவிக்கின்றான். அந்த அறிவிப்பை பெரும்பாலும் நாம் கவனக்குறைவின் காரணமாக
              அலட்சியமாக இருந்து விடுகிறோம். பின்னர், அந்த விருப்பங்களை நிறைவேற்றிக் கொள்ள
              முனையும் பொழுது, மனிதர்களின் அறிவைக் கொண்டு சாத்தியமில்லை என்று அப்பொழுது
              தான் பார்க்கிறோம். அந்தத் தருணமே இறைவன் அளித்த அந்த மகத்தான பாக்கியங்களைக்
              கொண்ட அந்த விருப்பங்களைத் தவற விட்டு விடுகிறோம். இவ்விதமாக நாம் நஷ்டவாளிகளாக
              நம் வாழ்க்கையில் பெரும்பாலான வழிமுறைகளில் தட்டழிந்தவர்களாகத் தொடர்ந்து
              கொண்டிருக்கிறோம்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              எனவே, இறைவனிடமிருந்து உங்களுக்கு விருப்பங்கள் இருதயத்தில் உருவாகும் அதே நேரம்
              உங்கள் கவனத்தைப் பாதுகாத்துக் கொள்ளுங்கள். அந்த விருப்பங்களுக்கு உரிய வழிமுறைகள்
              மனிதர்களின் அறிவைக் கொண்டு இல்லை என்பதை இறைவன் அறிவித்து விடுவதையும்
              தெளிவாக உணர்ந்து கொள்ளுங்கள். ஏனென்றால், இறைவன் படைப்பது முன்மாதிரி
              இல்லாததாகும்; புத்தம் புதிதாகும். அதனை அடையக் கூடிய வழிமுறைகளும் இனி தான்
              உங்களுக்காக புத்தம் புதிதாக படைக்கப்பட இருக்கிறது. அந்த வழிமுறைக்கு முன்மாதிரி
              கிடையாது.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              எனவே, உங்களுடைய இருதயத்தில் நீங்கள் விரும்பும் விருப்பங்களுக்கு அப்பொழுதே
              கொஞ்சமும் தாமதிக்காமல்,<span className='font-weight'> " என் இறைவனே, என் இருதயத்தில் தோற்றுவித்த இந்த
                விருப்பத்திற்கு அருள் பாக்கியத்திற்கு நீயே பொறுப்பேற்றுக் கொள்வாயாக. இந்த
                விருப்பத்திற்கான காலத் தவணையும், இன்னும், ஒவ்வொரு பொருளுக்குமான காலத்
                தவணையும் உன்னிடமே உள்ளது. காலத்தின் மீது சத்தியமாக இவ் வுண்மையின் மீது
                நான் நம்பிக்கை கொண்டேன். எனக்குப் பொறுமையை அளிப்பாயாக. இன்னும்,
                என்னை பொறுத்தருள்வாயாக, நிச்சயமாக நான் நஷ்டமடைந்தவர்களில் ஆகி விடாமல்
                என்னைப் பாதுகாக்கும் பொறுப்பையும் நீயே ஏற்றுக் கொள்வாயாக."</span>
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இவ்விதமாக நாம் நம் விருப்பங்களின் மீதான யாத்திரையை காலத்தின் மீது சத்தியமாக
              இறைவன் மீது பொறுப்பேற்படுத்தி பொறுமையைக் கொண்டு தொடர்கிறோம்.
              <span className='font-weight'> இது 'ஹஜ் ' எனும் யாத்திரையாகும்</span>. வாழ்க்கையில் ஒரு முறையாவது இறைவன் அளித்த விருப்பத்தை,
              மனித வழிமுறைகள் எதுவும் தீண்டாமல், இறைவனுடைய அனுமதியைக் கொண்டு
              பாக்கியங்களாலும், அருளாலும் நிறைவாக நிரம்பப் பெற்ற நிலையான ஒரு சுகத்தை,
              ஒரு நிம்மதியை நாம் அடையாத வரையில் நம் வாழ்க்கையில் நாம் சாந்தமும், சமாதானமும்
              அடைந்தவர்களாக வாழவில்லை என்பதாகும்.  நமக்கு நரகம் நிச்சயம்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              யார் ஒருவர் இவ்வகையில் நஷ்டம் அடையாதவர்களாக தங்கள் வாழ்க்கையில் வெற்றியாளர்களாக
              தன் காலத்திற்குள் வாழ்கிறார்களோ, இவர்களே சுவர்க்கவாசிகள். எனவே, இறை
              நம்பிக்கையாளர்களே, இறைவன் உங்களுக்கு விருப்பங்களை அருளும் பொழுது,
              முற்றிலுமாக நம்பிக்கை கொள்ளுங்கள். காலத்தின் மீது பொறுமையை மேற்கொள்வது
              கொண்டு முற்றிலுமாக அவனையே சார்ந்து விடுங்கள். மனிதர்களின் தீமையை விட்டும்,
              தீய எண்ணங்களைக் கொண்டும், ஆத்திரத்தைக் கொண்டும், அவசரப்படுத்தும் ஷைத்தானின்
              தூண்டுதல்களிலிருந்தும் உள்ளச்சத்துடன் இறைவனிடம் பாதுகாவல் தேடுங்கள். இன்னும்
              பொறுமைக்கான உறுதியை மேற்கொள்ளுங்கள். இன்னும் உறுதியான செயல்களிலெல்லாம்
              இதுவே மகத்தானதாகும். இவர்களே நம்பிக்கையுடன் நற்செயல்களை மேற்கொள்வோர். இவர்கள்
              வாழ்க்கையின் முழுமைக்கும் இறைவனே பொறுப்பேற்றுக் கொள்கின்றான்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              எனவே, இவ்வகையில் நீங்கள் வாழ்க்கையில் ஒருமுறையாவது
              <span className='font-weight'> 'ஹஜ்'</span> எனும் புனித யாத்திரையை
              மேற்கொள்வது உங்கள் மீது கடமையாகிறது. இதை நிறைவேற்றிக் கொள்ளாத வரையில்
              உங்களுக்கு சுவர்க்கம் கிடையாது. இந்த வகையில் நீங்கள் - முயற்சியுங்கள். அது
              <span className='font-weight'> 'உம்ரா' </span>
              என்று அழைக்கப்படுகிறது. நிச்சயமாக உம்ரா என்ற இறை பாதையிலான பொறுமையைக்
              கொண்டுள்ள முயற்சி உங்களுக்கு உங்களுடைய விருப்பங்களை இறைவனுடைய பாதையில்
              நிறைவேற்றித் தரும் ஹஜ் என்ற யாத்திரையைப் பூர்த்தியாக்கும். உங்களுடைய மனதின்
              பண்புகளில் நீங்கள் தூய்மையடையும் பொருட்டு, நோன்பு உங்கள் மீது கடமையாக்கப்
              பட்டிருக்கிறது. இந்த நோன்பு தாகித்திருப்பதும், பட்டினி கிடப்பதும் மட்டுமல்ல, இறைவனுக்கு
              நன்றி உணர்வுகளோடு, மனதின் தூய்மையைப் பேணியவர்களாக, மனித விரோதத்திலிருந்தும்,
              இறை துரோகத்திலிருந்தும் விலகியவர்களாக, மன இச்சைகளிலிருந்தும் தங்களைப் பாதுகாத்துக்
              கொள்ளும் பயபக்தியுடன் நிலைத்தவர்களாக நோன்பை நாம் இறைவனுக்காக உள்ளச்சத்துடன்
              பூர்த்தி செய்ய வேண்டும். இவ்வகையிலான நோன்பை எவரும் கடைபிடிப்பதில்லை. எனவே,
              நோன்பு பற்றியும், அதன் முறைகளைப் பற்றியும் மனிதர்களிடம் கேட்பதையோ, அவர்களின்
              வழிமுறைகளைப் பின்பற்றுவதையோ இது விஷயமாக மூதாதையர்கள் கற்றுக் கொடுப்பதையோ
              ஒருக்காலும் விரும்பாதீர்கள். இறைவனுடைய விருப்பத்தைப் பின்பற்றுங்கள். இந்தப் புத்தகத்தின்
              வசனங்களில் நோன்பு பற்றி அறிவிக்கப்பட்டிருக்கிறது. அதை சிந்தியுங்கள். இறைவன்
              உங்களுக்கு எந்த அளவுக்கு இருதயத்தில் விளக்கம் அளிக்கின்றானோ அதனையே பின்பற்றுங்கள்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              <span className='font-weight'>குர்பானி என்பது என்ன? </span>
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இறைவனுக்காக உங்களுடைய உயிர்களையும், பொருள்களையும் கொண்டு தியாகம்
              செய்வதாகும். ஏனென்றால், இறைவனுடைய வாக்கு உங்களுடைய உயிர்களையும்,
              பொருள்களையும் கொண்டு நீங்கள் தியாகம் செய்வீர்களானால் நிச்சயமாக உங்களுக்கு
              சுவர்க்க வாழ்க்கை இம்மையிலும், மறுமையிலும் உண்டு என்பதாகும். நிச்சயமாக இறைவன்
              தன்னுடய வாக்குறுதிக்கு மாறு செய்ய மாட்டான். எனவே, குர்பானி என்பது ஆட்டையோ,
              மாட்டையோ, ஒட்டகையையோ அறுத்து, அதன் மாமிசத்தைப் பகிர்ந்து அளிப்பது மட்டுமல்ல,
              உங்களுடைய உயிர்களையும், பொருளையும் கொண்டு அல்லாஹ்வின் பாதையில், உங்கள்
              நன்மைக்காகவே தியாகம் செய்வாதாகும்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              <span className='font-weight'>ஜகாத் என்பது என்ன?</span>
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              ஜகாத் என்பதன் பொருள் இறைவன் திருப்தியடையும் பொருட்டு அகத்தைத் தூய்மைப்படுத்திக் கொள்ளுதலாகும்.  இது மறைவான ஜகாத் ஆகும். வெளிப்படையானதும் இருக்கிறது.  அது பொதுவாக யாவரும் செய்யக் கூடிய தர்மமாக இருக்கிறது.  எனினும், மறைவான ஜகாத்தே வெளிப்படையாகச் செய்யும் ஜகாத்தை விட சிறந்ததாக இறைவன் நல்லுபதேசம் செய்கிறான்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              <span className='font-weight'>சதக்கா என்பது என்ன?</span>
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              சத்தியத்தையும், உடன்படிக்கைகளையும் நிறைவேற்றுவதும், பொய் சொல்வதிலிருந்தும்
              தங்களைப் பாதுகாத்துக் கொள்வதுமே சதக்கா என்பதன் பொருள் ஆகும்.
            </p>
            <p className='p-para' style={{ fontFamily: getFontFamily(), fontSize: `${context.fontSize}px` }}>
              இப் புத்தகத்தைப் படிக்கும் நீங்கள் உங்கள் நலனுக்காக உங்கள் இறைவனிடம் நீங்கள்
              திரும்புவதற்கு உரிய பாதையை நீங்கள் அடைவதற்காக வேண்டியே என்பதை மனதில்
              கொண்டவர்களாக ஆரம்பியுங்கள். அறிந்து கொள்வோம், மனிதர்களுடைய வழிமுறைகளையும்,
              அவர்களுடைய போக்குகளையும், அவர்களுடைய சகவாசங்களையும் முழுமையுமாக
              மனதிலிருந்து நீக்கிக் கொண்டு, இறைவன் ஒருவனை மட்டுமே மனதில் கொண்டு முற்றிலுமாக
              உள்ளத்தைத் தூய்மையாக்கிக் கொண்டவர்களாகவும், முற்றிலுமாக ஞானங்களுக்காகவும்,
              நேர்வழிக்காகவும் அவனிடமே சரணடைந்தவர்களாகவும் இந்தப் புத்தகத்தை கண்ணியத்துடன்
              நாம் அணுகுவோமாக.
            </p>
            <p className='text-right font-weight p-para'>- டாக்டர் ஃபஸ்லுர் ரஹ்மான்</p>

          </div >
      }

    </>
  )
}

export default AboutTheBook